docs/benchmark/results-wrk2-c1000/raw/nginx-R120000-r3.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.459ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.461ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.456ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.451ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms  705.17us   9.63ms   69.66%
    Req/Sec    31.64k     2.51k   41.33k    72.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.33ms
 75.000%    1.88ms
 90.000%    2.39ms
 99.000%    3.33ms
 99.900%    5.16ms
 99.990%    7.72ms
 99.999%    8.57ms
100.000%    9.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.088     0.000000            1         1.00
       0.650     0.100000        45108         1.11
       0.832     0.200000        90202         1.25
       0.993     0.300000       135136         1.43
       1.159     0.400000       180001         1.67
       1.333     0.500000       225054         2.00
       1.428     0.550000       247669         2.22
       1.524     0.600000       270072         2.50
       1.629     0.650000       292589         2.86
       1.749     0.700000       315059         3.33
       1.878     0.750000       337505         4.00
       1.947     0.775000       348747         4.44
       2.021     0.800000       360107         5.00
       2.097     0.825000       371278         5.71
       2.181     0.850000       382677         6.67
       2.275     0.875000       393868         8.00
       2.329     0.887500       399488         8.89
       2.387     0.900000       405082        10.00
       2.451     0.912500       410671        11.43
       2.521     0.925000       416250        13.33
       2.607     0.937500       421882        16.00
       2.659     0.943750       424701        17.78
       2.719     0.950000       427558        20.00
       2.789     0.956250       430331        22.86
       2.863     0.962500       433119        26.67
       2.945     0.968750       435964        32.00
       2.987     0.971875       437346        35.56
       3.031     0.975000       438746        40.00
       3.079     0.978125       440165        45.71
       3.129     0.981250       441583        53.33
       3.189     0.984375       443006        64.00
       3.221     0.985938       443691        71.11
       3.259     0.987500       444395        80.00
       3.301     0.989062       445084        91.43
       3.355     0.990625       445785       106.67
       3.425     0.992188       446496       128.00
       3.471     0.992969       446840       142.22
       3.529     0.993750       447184       160.00
       3.595     0.994531       447534       182.86
       3.703     0.995313       447884       213.33
       3.885     0.996094       448241       256.00
       3.979     0.996484       448414       284.44
       4.077     0.996875       448587       320.00
       4.179     0.997266       448765       365.71
       4.291     0.997656       448946       426.67
       4.431     0.998047       449115       512.00
       4.535     0.998242       449202       568.89
       4.655     0.998437       449294       640.00
       4.823     0.998633       449381       731.43
       4.995     0.998828       449466       853.33
       5.195     0.999023       449554      1024.00
       5.311     0.999121       449598      1137.78
       5.479     0.999219       449642      1280.00
       5.695     0.999316       449687      1462.86
       5.979     0.999414       449730      1706.67
       6.267     0.999512       449774      2048.00
       6.359     0.999561       449796      2275.56
       6.451     0.999609       449818      2560.00
       6.571     0.999658       449840      2925.71
       6.719     0.999707       449862      3413.33
       6.907     0.999756       449884      4096.00
       6.971     0.999780       449895      4551.11
       7.087     0.999805       449906      5120.00
       7.263     0.999829       449917      5851.43
       7.423     0.999854       449928      6826.67
       7.571     0.999878       449940      8192.00
       7.619     0.999890       449944      9102.22
       7.747     0.999902       449950     10240.00
       7.815     0.999915       449955     11702.86
       7.923     0.999927       449961     13653.33
       7.967     0.999939       449966     16384.00
       8.003     0.999945       449969     18204.44
       8.047     0.999951       449972     20480.00
       8.075     0.999957       449974     23405.71
       8.087     0.999963       449979     27306.67
       8.103     0.999969       449980     32768.00
       8.111     0.999973       449981     36408.89
       8.155     0.999976       449983     40960.00
       8.163     0.999979       449984     46811.43
       8.191     0.999982       449985     54613.33
       8.295     0.999985       449987     65536.00
       8.295     0.999986       449987     72817.78
       8.479     0.999988       449988     81920.00
       8.567     0.999989       449989     93622.86
       8.567     0.999991       449989    109226.67
       9.327     0.999992       449990    131072.00
       9.327     0.999993       449990    145635.56
       9.471     0.999994       449991    163840.00
       9.471     0.999995       449991    187245.71
       9.471     0.999995       449991    218453.33
       9.527     0.999996       449992    262144.00
       9.527     0.999997       449992    291271.11
       9.527     0.999997       449992    327680.00
       9.527     0.999997       449992    374491.43
       9.527     0.999998       449992    436906.67
       9.639     0.999998       449993    524288.00
       9.639     1.000000       449993          inf
#[Mean    =        1.447, StdDeviation   =        0.705]
#[Max     =        9.632, Total count    =       449993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1725642 requests in 15.00s, 1.07GB read
Requests/sec: 115034.22
Transfer/sec:     73.17MB