docs/benchmark/results-wrk2-c1000/raw/nginx-R150000-r1.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.588ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.627ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.619ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.611ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.57ms    0.92ms  16.17ms   80.47%
    Req/Sec    39.57k     3.22k   50.67k    70.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.41ms
 75.000%    1.97ms
 90.000%    2.57ms
 99.000%    4.39ms
 99.900%   10.63ms
 99.990%   12.28ms
 99.999%   13.92ms
100.000%   16.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.095     0.000000            1         1.00
       0.698     0.100000        56385         1.11
       0.899     0.200000       112555         1.25
       1.079     0.300000       168989         1.43
       1.245     0.400000       225257         1.67
       1.409     0.500000       281514         2.00
       1.496     0.550000       309569         2.22
       1.592     0.600000       337628         2.50
       1.704     0.650000       365725         2.86
       1.830     0.700000       393784         3.33
       1.973     0.750000       421879         4.00
       2.053     0.775000       435930         4.44
       2.137     0.800000       450307         5.00
       2.225     0.825000       464164         5.71
       2.323     0.850000       478180         6.67
       2.435     0.875000       492221         8.00
       2.495     0.887500       499233         8.89
       2.567     0.900000       506365        10.00
       2.647     0.912500       513402        11.43
       2.739     0.925000       520343        13.33
       2.847     0.937500       527409        16.00
       2.907     0.943750       530915        17.78
       2.971     0.950000       534397        20.00
       3.039     0.956250       537884        22.86
       3.111     0.962500       541428        26.67
       3.191     0.968750       544958        32.00
       3.237     0.971875       546710        35.56
       3.291     0.975000       548440        40.00
       3.359     0.978125       550227        45.71
       3.455     0.981250       551946        53.33
       3.633     0.984375       553700        64.00
       3.785     0.985938       554580        71.11
       3.999     0.987500       555462        80.00
       4.219     0.989062       556357        91.43
       4.543     0.990625       557228       106.67
       4.947     0.992188       558097       128.00
       5.251     0.992969       558540       142.22
       5.619     0.993750       558974       160.00
       6.131     0.994531       559418       182.86
       6.675     0.995313       559856       213.33
       7.239     0.996094       560291       256.00
       7.559     0.996484       560511       284.44
       7.911     0.996875       560731       320.00
       8.199     0.997266       560950       365.71
       8.559     0.997656       561171       426.67
       9.023     0.998047       561391       512.00
       9.319     0.998242       561502       568.89
       9.583     0.998437       561610       640.00
       9.919     0.998633       561719       731.43
      10.351     0.998828       561830       853.33
      10.663     0.999023       561941      1024.00
      10.807     0.999121       561997      1137.78
      10.983     0.999219       562050      1280.00
      11.119     0.999316       562106      1462.86
      11.223     0.999414       562160      1706.67
      11.383     0.999512       562215      2048.00
      11.439     0.999561       562242      2275.56
      11.495     0.999609       562271      2560.00
      11.559     0.999658       562298      2925.71
      11.647     0.999707       562325      3413.33
      11.743     0.999756       562353      4096.00
      11.791     0.999780       562366      4551.11
      11.839     0.999805       562379      5120.00
      11.871     0.999829       562394      5851.43
      11.967     0.999854       562406      6826.67
      12.175     0.999878       562420      8192.00
      12.247     0.999890       562428      9102.22
      12.319     0.999902       562434     10240.00
      12.519     0.999915       562440     11702.86
      12.639     0.999927       562447     13653.33
      12.751     0.999939       562454     16384.00
      12.815     0.999945       562459     18204.44
      12.863     0.999951       562461     20480.00
      12.903     0.999957       562464     23405.71
      13.319     0.999963       562469     27306.67
      13.575     0.999969       562471     32768.00
      13.615     0.999973       562473     36408.89
      13.679     0.999976       562476     40960.00
      13.679     0.999979       562476     46811.43
      13.703     0.999982       562478     54613.33
      13.743     0.999985       562480     65536.00
      13.783     0.999986       562481     72817.78
      13.919     0.999988       562482     81920.00
      13.919     0.999989       562482     93622.86
      13.943     0.999991       562483    109226.67
      14.319     0.999992       562484    131072.00
      14.471     0.999993       562485    145635.56
      14.471     0.999994       562485    163840.00
      14.471     0.999995       562485    187245.71
      14.519     0.999995       562486    218453.33
      14.519     0.999996       562486    262144.00
      15.255     0.999997       562487    291271.11
      15.255     0.999997       562487    327680.00
      15.255     0.999997       562487    374491.43
      15.255     0.999998       562487    436906.67
      15.255     0.999998       562487    524288.00
      16.175     0.999998       562488    582542.22
      16.175     1.000000       562488          inf
#[Mean    =        1.573, StdDeviation   =        0.918]
#[Max     =       16.168, Total count    =       562488]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2156899 requests in 15.00s, 1.34GB read
Requests/sec: 143782.46
Transfer/sec:     91.46MB